# PreDocEventArgs Properties

---
The PreDocEventArgs type exposes the following members.
| Name| Description
---|---|---
| Cancel|  Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it. (Inherited from RevitEventArgs)
| Cancellable|  Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitEventArgs)
| Document|  The document associated with the event.
Top
#### Reference
PreDocEventArgs Class
Autodesk.Revit.DB.Events Namespace